// Задача 25: Напишите цикл, который принимает на вход два числа (A и B) и возводит число A в натуральную степень B.
// 3, 5 -> 243 (3⁵)
// 2, 4 -> 16

// Console.Write("Введите число A: ");
// double numA = double.Parse(Console.ReadLine()!);
// Console.Write("Введите число B: ");
// int numB = int.Parse(Console.ReadLine()!);
// Console.WriteLine($"Результат возведения числа {numA} в степень {numB} будет {Math.Pow(numA, numB)} ");


// Напишите программу, которая принимает на вход число и выдаёт сумму цифр в числе.
// 452 -> 11
// 82 -> 10
// 9012 -> 12

// Console.Write ("Введите число: ");
// string array = Console.ReadLine()!;
// int sum=0;
// for (int i=0; i<array.Length;i++){
//     sum += int.Parse(array[i].ToString());
// };
// Console.Write($"Сумма цифр в числе {String.Join("",array)} будет {sum}");

